{"id":77295,"date":"2020-02-02T07:24:59","date_gmt":"2020-02-02T07:24:59","guid":{"rendered":"https:\/\/airlines-airports.com\/?p=77295"},"modified":"2021-06-01T04:25:00","modified_gmt":"2021-06-01T04:25:00","slug":"coronavirus-travel-updates","status":"publish","type":"post","link":"https:\/\/airlines-airports.com\/coronavirus-travel-updates\/","title":{"rendered":"CoronaVirus &#8211; Travel updates"},"content":{"rendered":"<p><strong>Last updated on<\/strong> :1st June 2021<\/p>\n<p>Recently 2019 novel CoronaVirus (nCoVid) is a big issue all around the world. 2019 Novel CoronaVirus is a new respiratory virus which causes illness to respiratory system, fever, cough, shortness of breath and breathing difficulties.<\/p>\n<h2>2019 novel CoronaVirus (nCoV) &#8211; Travel updates<\/h2>\n<p><strong>Last updated on 19-8-2020<\/strong><\/p>\n<p>Due to 2019 novel CoronaVirus (nCoV), nationals of People&#8217;s Republic of China are not allowed to enter in to some countries. Check the details below:<\/p>\n<h2><a class=\"index\" href=\"#A\">A<\/a> <a class=\"index\" href=\"#B\">B<\/a> <a class=\"index\" href=\"#C\">C<\/a> <a class=\"index\" href=\"#D\">D<\/a> <a class=\"index\" href=\"#E\">E<\/a> <a class=\"index\" href=\"#F\">F<\/a> <a class=\"index\" href=\"#G\">G<\/a> <a class=\"index\" href=\"#H\">H<\/a> <a class=\"index\" href=\"#I\">I<\/a> <a class=\"index\" href=\"#J\">J<\/a> <a class=\"index\" href=\"#K\">K<\/a> <a class=\"index\" href=\"#L\">L<\/a> <a class=\"index\" href=\"#M\">M<\/a> <a class=\"index\" href=\"#N\">N<\/a> <a class=\"index\" href=\"#O\">O<\/a> <a class=\"index\" href=\"#P\">P<\/a> <a class=\"index\" href=\"#Q\">Q<\/a> <a class=\"index\" href=\"#R\">R<\/a> <a class=\"index\" href=\"#S\">S<\/a> <a class=\"index\" href=\"#T\">T<\/a> <a class=\"index\" href=\"#U\">U<\/a> <a class=\"index\" href=\"#V\">V<\/a> <a class=\"index\" href=\"#W\">W<\/a> <a class=\"index\" href=\"#X\">X<\/a> <a class=\"index\" href=\"#Y\">Y<\/a> <a class=\"index\" href=\"#Z\">Z<\/a><\/h2>\n<h3 id=\"A\">A<\/h3>\n<h3>Albania<\/h3>\n<p>All flights to Albania are suspended.<br \/>\n&#8211; This does not apply to flights operated by Air Albania (ZB) from\/to Istanbul (IST).<\/p>\n<h3>Angola<\/h3>\n<ul>\n<li>Passengers who have been or stayed in the Nationals of People&#8217;s Republic of China, Algeria, Egypt, Iran, Italy, Korea (Rep.) and Nigeria are not allowed to enter or transit through Angola.<\/li>\n<\/ul>\n<h3>Antigua and Barbuda<\/h3>\n<ul>\n<li>Passengers and Airline crew who have been in the Nationals of People&#8217;s Republic of China in the past 28 days are not allowed to enter or transit through Antigua and Barbuda.<\/li>\n<li>Antigua and Barbuda nationals and residents who have been in China are allowed to enter Antigua and Barbuda.<\/li>\n<\/ul>\n<h3>Argentina<\/h3>\n<p><strong>Updated on 5-8-2020<\/strong><\/p>\n<ul>\n<li>Nationals and residents of Argentina can enter Argentina.<\/li>\n<li>Except repatriation and medical flights, all flights are suspended till 16 th August 2020.<\/li>\n<\/ul>\n<h3>Armenia<\/h3>\n<p>Nationals of People&#8217;s Republic of China with a normal passport and Iran nationals will obtain a visa on arrival or eVisa in Armenia.<\/p>\n<h3>Aruba<\/h3>\n<p>Passengers and airline crew who have been in China (People&#8217;s Rep.), Iran, Italy, Japan or Korea (Rep.) in the past 14 days will be subject to immediate screening by the Department of Public Health. The Department of Public Health will decide if the passengers or airline crew must be quarantined or isolated.<\/p>\n<h3>Australia<\/h3>\n<ul>\n<li>Any country&#8217;s passenger who already transited through China in the past 14 days, transited through Iran on or after March 1st, 2020,  Korea (Rep.) on or after 2100 AEDST 5 March 2020 will not be allowed to enter or transit Australia.<\/li>\n<li>Nationals or residence of Australia or nationals of New Zealand who resides in Australia will be asked to self isolate for 14 days.<\/li>\n<li>Passengers who have been in the cruise ship &#8216;Diamond Princess&#8217; are not allowed to transit or enter Australia.<\/li>\n<li>Passengers who have transited through or have been in Italy on or after 5 March 2020 will be required to go through medical screening upon arrival to Australia.<\/li>\n<\/ul>\n<p><strong>Check <a href=\"https:\/\/yellowpagesau.com.au\/how-to-apply-for-g2g-pass-to-enter-australia\/\">here<\/a> the procedures and documents required to enter into Australia<\/strong><\/p>\n<h3>Austria<\/h3>\n<ol>\n<li>Passengers and airline crew members who have been in the Hubei Province of China (People&#8217;s Republic of China), Italy, Iran and Korea in the past 14 days must have a medical certificate dated from a maximum of 4 days before their arrival in Austria. The medical certificate must :<br \/>\n&#8211; confirm that the person is not affected by Coronavirus (COVID-19), and<br \/>\n&#8211; be in German or in English, and<br \/>\n&#8211; be obtained at <a href=\"https:\/\/infothek.bmvit.gv.at\/massnahmen-bei-der-einreise-aus-sars-cov-2-risikogebieten\/\">https:\/\/infothek.bmvit.gv.at\/massnahmen-bei-der-einreise-aus-sars-cov-2-risikogebieten\/<\/a> .<\/li>\n<li>This does not apply to nationals of Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Ireland (Rep.), Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Netherlands, Norway, Poland, Portugal, Romania, Slovakia, Slovenia, Spain, Sweden and Switzerland.<\/li>\n<li>This does not apply to passengers with a British passport.<\/li>\n<li>This does not apply to crew members of cargo, emergency, rescue\/ambulance or ferry flights.<\/li>\n<\/ol>\n<h3>Azerbaijan<\/h3>\n<ul>\n<li>Nationals of China (People&#8217;s Rep.), Bahrain, Indonesia, Iran, Israel, Japan, Korea (Rep.), Kuwait, Malaysia, Oman, Qatar, Saudi Arabia, Singapore, UAE and USA are not allowed to enter  or transit through Azerbaijan if they  do not have a visa obtained before departure.<\/li>\n<\/ul>\n<hr \/>\n<p><strong><a class=\"index\" href=\"#LAW\">Go To Top<\/a><\/strong><\/p>\n<h3 id=\"B\">B<\/h3>\n<h3>Bahamas<\/h3>\n<p>Bahamas borders are closed until 15 April 2020.<br \/>\n&#8211; This does not apply to repatriation flights of foreign nationals from the Bahamas.<\/p>\n<h3>Bahrain<\/h3>\n<ul>\n<li>Passengers or cabin crew who have transited or stayed at the nationals of People&#8217;s Republic of China, Korea, Iran, Iraq in the past 14 days are not allowed to enter or transit through Bahrain.<\/li>\n<li>Passengers or cabin crew who have been or stayed in Hong Kong (SAR China), Italy, Japan, Lebanon, Malaysia, Singapore or Thailand in the past 14 days must have a valid visa prior to arrival.<\/li>\n<li>The nationals or residence of Bahrain, Kuwait, Oman, Saudi Arabia, UAE will be transferred to the medical service if they require for the treatment.<\/li>\n<\/ul>\n<hr \/>\n<p><strong><a class=\"index\" href=\"#LAW\">Go To Top<\/a><\/strong><\/p>\n<h3 id=\"C\">C<\/h3>\n<h3>Canada<\/h3>\n<p>Passengers who traveled in the cruise ship &#8220;<strong>Diamond Princess<\/strong>&#8221; will be quarantined upon arrival.<\/p>\n<h3>Chile<\/h3>\n<p>Passengers and airline crew who have been in Italy or Spain will be isolated for 14 days.<\/p>\n<h3>China<\/h3>\n<ol>\n<li style=\"font-weight: 400;\">All passengers arriving at PEK must self-isolate for 14 days.<\/li>\n<li style=\"font-weight: 400;\">Passengers arriving from Iran, Italy, Japan or Korea (Rep.) and traveling to Beijing (PEK), Guangzhou (CAN) or Shanghai (PVG) are subject to quarantine for 14 days.<\/li>\n<\/ol>\n<h3>Chinese Taipei<\/h3>\n<p>As of 25.05.2021<\/p>\n<p>1. Passengers are not allowed to enter.<br \/>\n&#8211; This does not apply to:<br \/>\n&#8211; passengers with a Chinese Taipei travel document;<br \/>\n&#8211; passengers with an Alien Resident Certificate;<br \/>\n&#8211; passengers with a &#8220;SPECIAL ENTRY PERMIT FOR COVID-19 OUTBREAK&#8221; visa with &#8220;DC&#8221;, &#8220;ER&#8221;, &#8220;FD&#8221; or &#8220;FO&#8221; stated on remarks;<br \/>\n&#8211; passengers with a MOFA ID.<br \/>\n2. Passengers are not allowed to transit.<br \/>\n3. Passengers must have a negative COVID-19 RT-PCR test result issued at most 3 working days before departure from the first embarkation point. Details can be found at <a href=\"https:\/\/www.cdc.gov.tw\/Category\/MPage\/XQ9r73gXAgEfJZV9zm6gaA\">https:\/\/www.cdc.gov.tw\/Category\/MPage\/XQ9r73gXAgEfJZV9zm6gaA<\/a><br \/>\n&#8211; This does not apply to:<br \/>\n&#8211; passengers with a Chinese Taipei (on the cover: Republic of China Taiwan) passport;<br \/>\n&#8211; passengers with an Alien Resident Certificate.<br \/>\n4. Passengers with a Chinese Taipei (on the cover: Republic of China Taiwan) passport without a negative COVID-19 RT-PCR test result issued at most 3 working days before departure from the first embarkation point:<br \/>\n&#8211; must complete an &#8220;Entry Quarantine Affidavit&#8221; before departure available at <a href=\"https:\/\/www.cdc.gov.tw\/File\/Get\/bkwclrVuZY_x9P5kYTRVmA\">https:\/\/www.cdc.gov.tw\/File\/Get\/bkwclrVuZY_x9P5kYTRVmA<\/a> ;<br \/>\n&#8211; are subject to an RT-PCR test upon arrival at their own expense. Details can be found at <a href=\"https:\/\/www.cdc.gov.tw\/Category\/MPage\/XQ9r73gXAgEfJZV9zm6gaA\">https:\/\/www.cdc.gov.tw\/Category\/MPage\/XQ9r73gXAgEfJZV9zm6gaA<\/a> .<br \/>\n5. Passengers with an Alien Resident Certificate without a negative COVID-19 RT-PCR test result issued at most 3 working days before departure from the first embarkation point:<br \/>\n&#8211; must complete an &#8220;Entry Quarantine Affidavit&#8221; before departure available at <a href=\"https:\/\/www.cdc.gov.tw\/File\/Get\/bkwclrVuZY_x9P5kYTRVmA\">https:\/\/www.cdc.gov.tw\/File\/Get\/bkwclrVuZY_x9P5kYTRVmA<\/a> ;<br \/>\n&#8211; are subject to an RT-PCR test upon arrival at their own expense. Details can be found at <a href=\"https:\/\/www.cdc.gov.tw\/Category\/MPage\/XQ9r73gXAgEfJZV9zm6gaA\">https:\/\/www.cdc.gov.tw\/Category\/MPage\/XQ9r73gXAgEfJZV9zm6gaA<\/a> .<br \/>\n6. A completed &#8220;Quarantine System for Entry Form&#8221; must be submitted before departure at <a href=\"https:\/\/hdhq.mohw.gov.tw\/\">https:\/\/hdhq.mohw.gov.tw\/<\/a><br \/>\n7. Passengers must:<br \/>\n&#8211; have a confirmed booking of quarantine facility or hotel; or<br \/>\n&#8211; present a completed affidavit obtained before departure at <a href=\"https:\/\/hdhq.mohw.gov.tw\/\">https:\/\/hdhq.mohw.gov.tw\/<\/a> or upon arrival, if they quarantine at home.<br \/>\n8. Passengers are subject to quarantine for 14 days.<\/p>\n<h3>Comoros<\/h3>\n<p>All airports in Comoros are closed as of 20.03.2020.<\/p>\n<h3>Croatia<\/h3>\n<p><strong>As of 20.03.2020<\/strong><\/p>\n<p>Upto 18 th April 2020, passengers are not allowed to cross the borders.<\/p>\n<p>&#8211; This does not apply to nationals of Croatia and to those going to a country where they work and live.<br \/>\n&#8211; This does not apply to nationals of the Schengen Member States, passengers form the United Kingdom and their family members.<br \/>\n&#8211; This does not apply to passengers with a long-term resident permit or a long-term visa issued by a Schengen Member State or the United Kingdom.<br \/>\n&#8211; This does not apply to healthcare professionals, healthcare researchers and collaborators, experts in care for the elderly, and persons requiring urgent medical treatment.<br \/>\n&#8211; This does not apply to cross-border workers.<br \/>\n&#8211; This does not apply to diplomats, police officers in the performance of their activities, Civil Defence services and teams, international organizations staff and International military personnel in carrying out their functions.<\/p>\n<hr \/>\n<p><strong><a class=\"index\" href=\"#LAW\">Go To Top<\/a><\/strong><\/p>\n<h3 id=\"E\">E<\/h3>\n<h3>Egypt<\/h3>\n<p style=\"font-weight: 400;\">1. Nationals of Qatar are not allowed to enter Egypt.<\/p>\n<ol start=\"2\">\n<li style=\"font-weight: 400;\">Passengers who have been in Bahrain, China (People&#8217;s Rep.), Chinese Taipei, France, Germany, Hong Kong (SAR China), Iran, Iraq, Italy, Japan, Korea (Rep.), Kuwait, Macao (SAR China), Malaysia, Singapore, Switzerland, Spain, Thailand or Vietnam will be screened upon arrival, and;<\/li>\n<\/ol>\n<p style=\"font-weight: 400;\">-must present a completed “Health Observation Card”, upon arrival, and<\/p>\n<p style=\"font-weight: 400;\">-will be followed up for a period of 14 days.<\/p>\n<p style=\"font-weight: 400;\">Before arrival of the flight, carriers must complete and present a “Notifying Form” to the General Quarantine administration.<\/p>\n<hr \/>\n<p><strong><a class=\"index\" href=\"#LAW\">Go To Top<\/a><\/strong><\/p>\n<h3 id=\"F\">F<\/h3>\n<h3>Fiji<\/h3>\n<ul>\n<li>Passengers and crew members who stayed or have been in People&#8217;s Republic of China, Iran, Italy or in Cheongdo County and Daegu City in Korea (Republic) in the past 14 days will not be allowed to enter or transit Fiji.<\/li>\n<li>This does not applicable to the nationals or residence of Fiji.<\/li>\n<\/ul>\n<h3>France<\/h3>\n<p>Passengers who are coming from a non-Schengen Member State are not allowed to enter France.<br \/>\nThis does not apply to:<br \/>\n&#8211; nationals of EEA Member States, Switzerland and passengers with a British passport with nationality “British Citizen&#8221;, “British Overseas Territories Citizen&#8221; issued by Gibraltar, British Passports with a Certificate of Entitlement to the Right of Abode issued by the United Kingdom;<br \/>\n&#8211; passengers with residence permit issued by France;<br \/>\n&#8211; passengers with a residence permit issued by an EEA Member States, Switzerland or the United Kingdom on their way home;<br \/>\n&#8211; healthcare professionals, health researchers related to Coronavirus (Covid-19).<\/p>\n<hr \/>\n<p><strong><a class=\"index\" href=\"#LAW\">Go To Top<\/a><\/strong><\/p>\n<h3 id=\"G\">G<\/h3>\n<h3 style=\"font-weight: 400;\">Georgia<\/h3>\n<ol>\n<li style=\"font-weight: 400;\">Nationals of China (People&#8217;s Rep.) arriving from China (People&#8217;s Rep.) or Iran are not allowed to enter Georgia.<\/li>\n<li style=\"font-weight: 400;\">Nationals of China (People&#8217;s Rep.) who have been in China (People&#8217;s Rep.) or Iran in the last 14 days are not allowed to enter Georgia.<\/li>\n<li style=\"font-weight: 400;\">Nationals of Iran arriving from China (People&#8217;s Rep.) or Iran are not allowed to enter Georgia.<\/li>\n<li style=\"font-weight: 400;\">Nationals of Iran who have been in China (People&#8217;s Rep.) or Iran in the last 14 days are not allowed to enter Georgia.<br \/>\n5. Nationals of Georgia who have transited through or have been in China (People&#8217;s Rep.), Iran, Italy or Korea (Rep.) in the past 14 days are required to undergo a 14-day quarantine.<\/li>\n<li style=\"font-weight: 400;\">Passengers other than nationals of Georgia who have transited through or have been in China (People&#8217;s Rep.), Iran, Italy or Korea (Rep.) in the past 14 days must:<\/li>\n<\/ol>\n<p style=\"font-weight: 400;\">&#8211; undergo a 14-day quarantine; or<\/p>\n<p style=\"font-weight: 400;\">&#8211; present a coronavirus-free (PCR) certificate issued by a laboratory of the country of departure or, in case of transit, by a laboratory of the transit country.<\/p>\n<h3>Guatemala<\/h3>\n<ul>\n<li>Passenger who stayed or have been in People&#8217;s Republic of China in the past 15 days will not be allowed to enter or transit Guatemala.<\/li>\n<li>The nationals or residence of Guatemala will be interviewed and transferred to the medical service if they require for the treatment.<\/li>\n<\/ul>\n<h3>Greece<\/h3>\n<p>Passengers whose flights from and to Italy and Spain are not allowed to enter or transit Greece.<\/p>\n<hr \/>\n<p><strong><a class=\"index\" href=\"#LAW\">Go To Top<\/a><\/strong><\/p>\n<h3 id=\"H\">H<\/h3>\n<h3>Hong Kong<\/h3>\n<ul>\n<li>Passenger who stayed or have been in the Hubei Province (People&#8217;s Republic of China) in the past 14 days will not be allowed to enter or transit Hong Kong (SAR China).<\/li>\n<li>The nationals or residence of Hong Kong (SAR China) will be transferred to the medical service if they require for the treatment.<\/li>\n<\/ul>\n<h3>Hungary<\/h3>\n<p>As of 20.03.2020, Hungary&#8217;s borders are closed.<br \/>\n&#8211; This does not apply to nationals of Hungary and EEA nationals with a residence permit issued by Hungary.<\/p>\n<hr \/>\n<p><strong><a class=\"index\" href=\"#LAW\">Go To Top<\/a><\/strong><\/p>\n<h3 id=\"I\">I<\/h3>\n<h3>India<\/h3>\n<ul>\n<li>Passengers who have been in the Nationals of People&#8217;s Republic of China in the past 20 days are not allowed to enter or transit through India.<\/li>\n<li>Indian residents who have been in China on or after 15th January 2020 will be quarantined upon arrival.<\/li>\n<\/ul>\n<h3>Indonesia<\/h3>\n<ul>\n<li>Passengers who have been in the Nationals of People&#8217;s Republic of China in the past 14 days are not allowed to enter or transit through Indonesia.<\/li>\n<li>Indonesian residents who have been in China will be quarantined upon arrival.<\/li>\n<li>Nationals of People&#8217;s Republic of China will no longer obtain a visa on arrival.<\/li>\n<\/ul>\n<h3>Iran<\/h3>\n<ul>\n<li>Nationals of People&#8217;s Republic of China with a normal passport, passengers with a Hong Kong (SAR China) passport and passengers with a Macao (SAR China) passport can only obtain Visa on arrival. They need to clear the medical \/ health check-up up on arrival.<\/li>\n<li>According to the UAE government travel restriction issues, UAE nationals will not be allowed to travel to Iran.<\/li>\n<\/ul>\n<h3>Iraq<\/h3>\n<ul>\n<li>Passengers and crew members who stayed or have been in People&#8217;s Republic of China, Hong Kong (SAR China), Iran, Italy, Japan, Korea (Rep.), Macao (SAR China), Singapore or Thailand in the past 14 days will not be allowed to enter or transit Iraq.<\/li>\n<li>Nationals of People&#8217;s Republic of China, Iran are not allowed to enter into Iraq.<\/li>\n<\/ul>\n<h3>Israel<\/h3>\n<ul>\n<li>Passengers who have been in the Nationals of People&#8217;s Republic of China in the past 14 days are not allowed to enter or transit through Israel.<\/li>\n<\/ul>\n<h3 style=\"font-weight: 400;\">Italy<\/h3>\n<p style=\"font-weight: 400;\">1.Passengers traveling as tourists are not allowed to enter via airports in below listed areas.<\/p>\n<p style=\"font-weight: 400;\">2.Passengers arriving at airports in below listed areas, are allowed to enter if they are traveling on business, for health reasons, in an emergency or if they reside in one of these areas. A completed “Self-declaration&#8221; form must be presented upon arrival.<\/p>\n<p style=\"font-weight: 400;\">&#8211; Areas: Alessandria, Asti, Lombardy, Modena, Novara, Padova, Parma, Pesaro and Urbino, Piacenza, Reggio Emilia, Rimini, Treviso-Venice, Verbano – Cusio &#8211; Ossola and Vercelli.<\/p>\n<hr \/>\n<p><strong><a class=\"index\" href=\"#LAW\">Go To Top<\/a><\/strong><\/p>\n<h3 id=\"J\">J<\/h3>\n<h3>Jamaica<\/h3>\n<ul>\n<li>Passengers who have been in the Nationals of People&#8217;s Republic of China traveling to Jamaica will be quarantined upon arrival atleast 14 days.<\/li>\n<\/ul>\n<h3>Japan<\/h3>\n<ul>\n<li>Passenger who stayed or have been in Hubei Province or Zhejiang Province (People&#8217;s Republic of China), Cheongdo County or Daegu City in Korea (Rep.), Gyeongsan-si, Andong-si , Yeongcheon-si, Chilgok-gun, Uiseong-gun, Seongju-gun or Gunwi-gun in Gyeongsangbuk-do in Korea (Rep.), Qom Province, Tehran Province or Gilan Province in Iran in the past 14 days will not be allowed to enter or transit Japan.<\/li>\n<li>The nationals or residence of Japan will be transferred to the medical service if they require for the treatment.<\/li>\n<li>If the passport issued for Nationals of China in Hubei Province or or Zhejiang Province (People&#8217;s Republic of China), they will not be allowed to enter Japan.<\/li>\n<li>Passengers who were in the cruise ship &#8216;Westerdam&#8217; are not allowed to enter Japan.<\/li>\n<\/ul>\n<h3>Jordan<\/h3>\n<ul>\n<li>Passengers who have been in the Nationals of People&#8217;s Republic of China in the past 14 days are not allowed to enter or transit through Jordan.<\/li>\n<\/ul>\n<hr \/>\n<p><strong><a class=\"index\" href=\"#LAW\">Go To Top<\/a><\/strong><\/p>\n<h3 id=\"K\">K<\/h3>\n<h3>Kazakhstan<\/h3>\n<p>Nationals of China (People’s Rep.) with a normal passport arriving at Almaty (ALA), Aktau (SCO), Astana (TSE), Karaganda (KGF), Shymkent (CIT) or Taraz (DMB) are no longer visa exempt<\/p>\n<h3>Korea<\/h3>\n<ul>\n<li>Passengers who have been in the Nationals of People&#8217;s Republic of China \/ Hubei Province in the past 14 days are not allowed to enter or transit through Korea.<\/li>\n<li>Visitors arriving from Japan who have been in the cruise ship &#8216;Diamond Princess&#8217; are not allowed to transit or enter (Korea Rep.).<\/li>\n<\/ul>\n<h3>Kyrgyzstan<\/h3>\n<p>As of 20.03.2020, All Flights to Kyrgyzstan are suspended.<\/p>\n<h3>Kuwait<\/h3>\n<ul>\n<li>Nationals of People&#8217;s Republic of China are not allowed to enter or transit through Kuwait.<\/li>\n<li>Passengers with a Hong Kong (SAR China) passport are not allowed to enter Kuwait<\/li>\n<li>Passenger who stayed or have been in People&#8217;s Republic of China in the past 14 days will not be allowed to enter or transit Kuwait.<\/li>\n<li>Passenger who stayed or have been in Hong Kong (SAR China), Iran, Iraq, Italy, Japan, Korea (Rep.), Singapore or Thailand in the past 14 days will not be allowed to enter or transit Kuwait.<\/li>\n<\/ul>\n<hr \/>\n<p><strong><a class=\"index\" href=\"#LAW\">Go To Top<\/a><\/strong><\/p>\n<h3 id=\"L\">L<\/h3>\n<h3>Lebanon<\/h3>\n<ul>\n<li>Passengers who have stayed or transited through China (People&#8217;s Rep.), Chinese Taipei, Hong Kong (SAR China), Iran, Italy, Japan, Korea (Rep.) or Macao (SAR China) in the past 14 days, are not allowed to enter or transit Lebanon.<\/li>\n<li>Nationals of Lebanon and resident of Lebanon who have been in China (People&#8217;s Rep.), Chinese Taipei, Hong Kong (SAR China), Iran, Italy, Japan, Korea (Rep.) or Macao (SAR China) must fill-in &#8220;The ministry of health new information form&#8221; before arrival.<\/li>\n<li>. Nationals of China (People&#8217;s Rep.), Iran, Italy, Japan and Korea (Rep.) are not allowed to enter and transit Lebanon.<\/li>\n<li>If the passenger has a passport issued by China, Chinese Taipei, Hong Kong (SAR China) and Macao (SAR China), Iran, Italy, Japan, Korea (Rep.) can enter or transit Lebanon if they<\/li>\n<\/ul>\n<p>&#8211; are residence or nationals of Lebanon or<\/p>\n<p>-have any of the documents such as Lebanon passport, Lebanon national ID card or civil extract<\/p>\n<p>-United Nations Interim Force in Lebanon (UNIFIL).<\/p>\n<hr \/>\n<p><strong><a class=\"index\" href=\"#LAW\">Go To Top<\/a><\/strong><\/p>\n<h3 id=\"M\">M<\/h3>\n<h3>Malaysia<\/h3>\n<ul>\n<li>Nationals of People&#8217;s Republic of China who stayed or have been in the Hubei Province are not allowed to enter or transit through Malaysia.<\/li>\n<li>It is not applicable to the passenger who reside in Malaysia.<\/li>\n<\/ul>\n<h3>Malta<\/h3>\n<p>As of 20.03.2020, All Flights to Malta are suspended.<\/p>\n<h3>Mongolia<\/h3>\n<ul>\n<li>Passenger who stayed or have been in People&#8217;s Republic of China in the past 30 days will not be allowed to enter or transit Mongolia<\/li>\n<li>It is not applicable to the passenger who reside in Mongolia.<\/li>\n<\/ul>\n<hr \/>\n<p><strong><a class=\"index\" href=\"#LAW\">Go To Top<\/a><\/strong><\/p>\n<h3 id=\"N\">N<\/h3>\n<h3>New Zealand<\/h3>\n<p><strong>New Zealand borders are closed from 20 th March 2020.<\/strong><\/p>\n<p>This does not apply to nationals of New Zealand, permanent residents and residents with valid travel conditions, and their immediate family.<br \/>\n&#8211; This does not apply to nationals Australia and permanent residents if New Zealand is their primary place of established residence.<br \/>\n&#8211; This does not apply to diplomats accredited to New Zealand and currently resident in New Zealand.<\/p>\n<hr \/>\n<p><strong><a class=\"index\" href=\"#LAW\">Go To Top<\/a><\/strong><\/p>\n<h3 id=\"O\">O<\/h3>\n<h3>Oman<\/h3>\n<ul>\n<li>The nationals of China, Iran, Italy are not allowed to enter Oman.<\/li>\n<li>Nationals of Bahrain, Kuwait, Qatar, Saudi Arabia and the United Arab Emirates are not allowed to enter Oman with a national Id card and they must travel with passport.<\/li>\n<li>Passengers arriving from China (People&#8217;s Rep.), Iran, Japan, Korea (Rep.) or Singapore will be quarantined for 14 days upon their arrival to Oman.<\/li>\n<li>Nationals of Oman are allowed to enter with a national ID card if they used the card when they departed from Oman.<\/li>\n<\/ul>\n<hr \/>\n<p><strong><a class=\"index\" href=\"#LAW\">Go To Top<\/a><\/strong><\/p>\n<h3 id=\"P\">P<\/h3>\n<h3>Philippines<\/h3>\n<ul>\n<li>Passenger who transited through or have been in People&#8217;s Republic of China, Hong Kong (SAR China) or Macao (SAR China) in the past 14 days will not be allowed to enter or transit Philippines.<\/li>\n<li>Residents or nationals of Philippines who transited through or have been in People&#8217;s Republic of China in the past 14 days will be required to self isolate for 14 days.<\/li>\n<\/ul>\n<h3>Portugal<\/h3>\n<p><strong>Flights to Portugal are suspended until 17 April 2020.<\/strong><br \/>\n-This does not apply to flights arriving from Angola, Austria, Belgium, Brazil (Sao Paulo (GRU) and Rio De Janeiro (RIO) airports only), Bulgaria, Canada, Cape Verde, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Guinea-Bissau, Hungary, Iceland, Ireland (Rep.), Italy, Latvia, Lithuania, Luxembourg, Malta, Mozambique, Netherlands, Norway, Poland, Portugal, Romania, Sao Tome and Principe, Slovakia, Slovenia, South Africa, Spain, Sweden, Switzerland, USA, United Kingdom or Venezuela.<br \/>\n&#8211; This does not apply to flights bringing back nationals and residence of Portugal.<\/p>\n<hr \/>\n<p><strong><a class=\"index\" href=\"#LAW\">Go To Top<\/a><\/strong><\/p>\n<h3 id=\"Q\">Q<\/h3>\n<h3>Qatar<\/h3>\n<p>Passengers who have been in China (People&#8217;s Rep.), Iran, Japan, Korea (Rep.) or Singapore in the past 14 days will be required to self isolate for 14 days.<\/p>\n<hr \/>\n<p><strong><a class=\"index\" href=\"#LAW\">Go To Top<\/a><\/strong><\/p>\n<h3 id=\"R\">R<\/h3>\n<h3>Russian Federation<\/h3>\n<ul>\n<li>Nationals of People&#8217;s Republic of China who travels to Kaliningrad (KGD), St. Petersburg (LED) or Vladivostok (VVO) will no longer obtain an eVisa.<\/li>\n<\/ul>\n<hr \/>\n<p><strong><a class=\"index\" href=\"#LAW\">Go To Top<\/a><\/strong><\/p>\n<h3 id=\"S\">S<\/h3>\n<h3>Saudi Arabia<\/h3>\n<ul>\n<li>Passengers who have transited through or have been in China (People&#8217;s Rep.), Chinese Taipei, Hong Kong (SAR China), Iran or Macao (SAR China) in the past 14 days are not allowed to enter or transit through Saudi Arabia.<\/li>\n<li>All the nationals of GCC countries will not be allowed to enter or transit through Saudi Arabia with the national ID card. They must carry their original passport.<\/li>\n<li>Tourist visas issued to nationals of Afghanistan, Azerbaijan, China (People&#8217;s Rep.), Chinese Taipei, Hong Kong (SAR China), India, Indonesia, Iran, Iraq, Italy, Japan, Kazakhstan, Korea (Rep.), Lebanon, Macao (SAR China), Malaysia, Pakistan, Philippines, Singapore, Somalia, Syria, Thailand, Uzbekistan, Vietnam and Yemen, are invalidated.<\/li>\n<li>Umrah visit or Prophet&#8217;s mosque visit will not be allowed and it does not apply to nationals of Bahrain, Kuwait, Oman, Qatar and United Arab Emirates with a visit permit obtained through the website of the Ministry of Hajj and Umrah.<\/li>\n<li>Airline crew will be subject to medical examination, if required.<\/li>\n<\/ul>\n<p>*All the above does not applicable to the nationals of Saudi Arabia.<\/p>\n<h3>Senegal<\/h3>\n<p><strong>Last updated:<\/strong> 31-08-2020<\/p>\n<ul>\n<li>Travel to Senegal are restarted.<\/li>\n<li>Nationals or residents of Austria, Belgium, Czechia, Denmark, Estonia, Finland, France, Germany, Greece, Hungary, Iceland, Italy, Latvia, Liechtenstein, Lithuania, Luxembourg, Malta, Netherlands, Norway, Poland, Portugal, Slovakia, Slovenia, Spain, Sweden and Switzerland are not allowed to enter.<\/li>\n<li>All the passengers over the age of 2 years must provide a negative COVID 18 test certificate upon arrival to Senegal. You can check <a href=\"https:\/\/airlines-airports.com\/travel-or-transit-to-senegal-during-covid-19-procedures-and-documents-required-to-travel\/\">here<\/a> for the local authorized medical institution to take COVID 19 test in Senegal.<\/li>\n<\/ul>\n<h3>Singapore<\/h3>\n<p>Singapore&#8217;s measures for inbound travellers in relation to COVID-19 are summarised in this table.<\/p>\n<p><img title=\"Summary Table\" src=\"https:\/\/www.ica.gov.sg\/images\/default-source\/ica-images\/contents\/covid-19\/summarytable1.jpg?sfvrsn=a9a7f229_0\" alt=\"SummaryTable1_20200814\" data-displaymode=\"Original\" \/><a href=\"https:\/\/safetravel.ica.gov.sg\/\" target=\"_blank\" rel=\"noopener noreferrer\"><img title=\"Schemes of Safe Travel arrangements\" src=\"https:\/\/www.ica.gov.sg\/images\/default-source\/ica-images\/contents\/covid-19\/safetravel-table.png?sfvrsn=868338cd_0\" alt=\"SafeTravel Table\" data-displaymode=\"Original\" \/><\/a><\/p>\n<p>For more details, visit <a href=\"https:\/\/www.ica.gov.sg\/covid-19\/ArrivalSG\">https:\/\/www.ica.gov.sg\/covid-19\/ArrivalSG<\/a><\/p>\n<h3>South Africa<\/h3>\n<ul>\n<li>Only Repatriation Flights, emergency flights will be allowed.<\/li>\n<li>Nationals and Residents of South Africa will undergo screening, medical check up and also 21 days quarantine.<\/li>\n<li>All flights to South Africa are suspended until 31 st August 2020.<\/li>\n<\/ul>\n<p>For more details visit <a href=\"https:\/\/www.gov.za\/Coronavirus\/travel\">here<\/a><\/p>\n<h3>SriLanka<\/h3>\n<ul>\n<li>Nationals of People&#8217;s Republic of China will no longer obtain a visa on arrival to SriLanka.<\/li>\n<\/ul>\n<hr \/>\n<p><strong><a class=\"index\" href=\"#LAW\">Go To Top<\/a><\/strong><\/p>\n<h3 id=\"T\">T<\/h3>\n<h3>Thailand<\/h3>\n<ul>\n<li>Based on the travel advisory restriction issued by United Arab Emirates Government, nationals of United Arab Emirates are not allowed to travel to Thailand.<\/li>\n<li>All other passengers,  please check with your airline.<\/li>\n<\/ul>\n<hr \/>\n<p><strong><a class=\"index\" href=\"#LAW\">Go To Top<\/a><\/strong><\/p>\n<h3 id=\"U\">U<\/h3>\n<h3>United Arab Emirates<\/h3>\n<p><strong>Last updated: 21-9-2020<\/strong><\/p>\n<p><strong>Who can enter UAE under COVID 19 situation?<\/strong><\/p>\n<ul>\n<li>Nationals and residents of UAE<\/li>\n<li>domestic helpers traveling with the sponsor,<\/li>\n<li>Tourist to Dubai,<\/li>\n<li>nationals of Bahrain, Kuwait, Oman and Saudi Arabia who have UAE Identity Card can arrive to Dubai.<\/li>\n<li>nationals of Korea (Rep.) traveling under the Fast Track program and arriving at Abu Dhabi or Dubai. They must have a pre-arranged visa or a pre-approval to enter;<\/li>\n<li>nationals of Indonesia traveling under the Safe Travel Corridor program. They must have an entry permit and a return ticket.<\/li>\n<\/ul>\n<p><strong>What is the procedure after entering UAE airport under COVID 19 situation?<\/strong><\/p>\n<ul>\n<li>Once passengers arrived at Abu Dhabi or Dubai, they must undergo medical screening.<\/li>\n<li>Submit a completed <a href=\"https:\/\/airlines-airports.com\/wp-content\/uploads\/2020\/05\/Self-Declaration-Form-Abu-Dhabi-Sharjah-UAE.pdf\">Self-Declaration-Form-UAE<\/a><\/li>\n<li>Download and register the COVID-19 DXB Smart App<\/li>\n<li>Health insurance is must for tourist to Dubai<\/li>\n<li>UAE residents who has residency visa must have <a href=\"https:\/\/airlines-airports.com\/how-to-get-ica-approval-to-enter-into-uae\/\" target=\"_blank\" rel=\"noopener noreferrer\">GDRFA approval<\/a>. Check <a href=\"https:\/\/uaeentry.ica.gov.ae\">status of your approval<\/a> before departure.<\/li>\n<li>Valid negative certificate for Coronavirus (COVID-19) PCR test. The test must have been taken at most 96 hours before departure. The certificate must be issued by an approved lab listed on https:\/\/screening.purehealth.ae or a lab accredited by the departure country. Children younger than 12 years and passengers with severe or moderate disabilities are not required to take this test.<\/li>\n<li>Nationals of Korea (Rep.) traveling under the Fast Track program must have an &#8216;Isolation Exemption Certificate.<\/li>\n<li>Transit is only allowed for maximum 24 hours at Abu Dhabi (AUH).<\/li>\n<li>Passengers transiting Abu Dhabi (AUH) for more than 8 hours must have a confirmed hotel booking.<\/li>\n<\/ul>\n<h3>United States of America (USA)<\/h3>\n<p>Flights that are airborne as of 17:00 US EST on 2 February 2020 are exempted from the Coronavirus-related travel restrictions.<\/p>\n<hr \/>\n<p><strong><a class=\"index\" href=\"#LAW\">Go To Top<\/a><\/strong><\/p>\n<h3 id=\"V\">V<\/h3>\n<h3>Vanuatu<\/h3>\n<ul>\n<li>Passenger who travels to Vanuatu will provide a valid medical certificate to prove they are not affected by 2019 novel coronavirus (2019 nCoV).<\/li>\n<li>All the passengers must fill an &#8220;passenger health declaration form&#8221; before boarding to flight to Vanuatu.<\/li>\n<li>Passengers who have stayed or transited through China (People&#8217;s Rep.), Chinese Taipei, Hong Kong (SAR China), Japan, Korea (Rep.), Macau (SAR China) or Singapore in the past 14 days are not allowed to enter Vanuatu.<\/li>\n<li>Passengers who have traveled or transited through China (People&#8217;s Rep.), Chinese Taipei, Hong Kong (SAR China), Japan, Korea (Rep.), Macau (SAR China) or Singapore on or after 31 December 2019, and who have spent the travel outside of China (People&#8217;s Rep.), Chinese Taipei, Hong Kong (SAR China), Japan, Korea (Rep.), Macau (SAR China) or Singapore in the past 14 days must obtain a valid medical certificate from any registered medical practitioner certifying that they are free from any respiratory illness suspected of Coronavirus (COVID-19).<\/li>\n<li>Nationals and residents of Vanuatu transiting for more than eight hours in Hong Kong SAR or Singapore or have left the terminal must be self-Quarantined for 14 days outside of Vanuatu before traveling into the country.<\/li>\n<\/ul>\n<h3>Vietnam<\/h3>\n<ul>\n<li>Passengers who have traveled or transited through China in the past 14 days are not allowed to enter Vietnam. This does not apply to passengers who travel for diplomatic or official purpose.<\/li>\n<li> All passengers must fill out a quarantine form prior to arrival.<\/li>\n<li>Passengers who travel for diplomatic or official purpose will undergo a medical examination at the border before allowed to enter Viet Nam.<\/li>\n<li>Passengers who have been or transited through Korea, Iran or Italy in the past 14 days will be quarantined for 14 days.<\/li>\n<li>Nationals of Italy and Korea (Rep.) with a normal passport are no longer visa exempt.<\/li>\n<\/ul>\n<h2><a href=\"https:\/\/airlines-airports.com\/coronavirus-covid19-air-travel-procedures-and-restrictions\/\" target=\"_blank\" rel=\"noopener noreferrer\">Flights to travel back to your country and what are the requirements \/  procedures<\/a><\/h2>\n","protected":false},"excerpt":{"rendered":"<p>Last updated on :1st June 2021 Recently 2019 novel CoronaVirus (nCoVid) is a big issue all around the world. 2019 Novel CoronaVirus is a new respiratory virus which causes illness to respiratory system, fever, cough, shortness of breath and breathing difficulties. 2019 novel CoronaVirus (nCoV) &#8211; Travel updates Last updated on 19-8-2020 Due to 2019 [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":77296,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"yasr_overall_rating":0,"yasr_post_is_review":"","yasr_auto_insert_disabled":"","yasr_review_type":"LocalBusiness"},"categories":[9753,5766],"tags":[9738],"yasr_visitor_votes":{"number_of_votes":0,"sum_votes":0,"stars_attributes":{"read_only":false,"span_bottom":false}},"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v17.0 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>CoronaVirus - Travel updates - Airlines-Airports<\/title>\n<meta name=\"description\" content=\"Travel advisory regarding Coronavirus for travelling to and from China. Before booking your flight tickets, check the CoronaVirus-Travel updates here.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/airlines-airports.com\/coronavirus-travel-updates\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"CoronaVirus - Travel updates - Airlines-Airports\" \/>\n<meta property=\"og:description\" content=\"Travel advisory regarding Coronavirus for travelling to and from China. Before booking your flight tickets, check the CoronaVirus-Travel updates here.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/airlines-airports.com\/coronavirus-travel-updates\/\" \/>\n<meta property=\"og:site_name\" content=\"Airlines-Airports\" \/>\n<meta property=\"article:published_time\" content=\"2020-02-02T07:24:59+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2021-06-01T04:25:00+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/airlines-airports.com\/wp-content\/uploads\/2020\/02\/2019-novel-coronavirus-ncov.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"600\" \/>\n\t<meta property=\"og:image:height\" content=\"300\" \/>\n<meta name=\"twitter:card\" content=\"summary\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Editor\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"19 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/airlines-airports.com\/#website\",\"url\":\"https:\/\/airlines-airports.com\/\",\"name\":\"Airlines-Airports\",\"description\":\"One stop destination for Airlines and Airports\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/airlines-airports.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/airlines-airports.com\/coronavirus-travel-updates\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/airlines-airports.com\/wp-content\/uploads\/2020\/02\/2019-novel-coronavirus-ncov.jpg\",\"contentUrl\":\"https:\/\/airlines-airports.com\/wp-content\/uploads\/2020\/02\/2019-novel-coronavirus-ncov.jpg\",\"width\":600,\"height\":300},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/airlines-airports.com\/coronavirus-travel-updates\/#webpage\",\"url\":\"https:\/\/airlines-airports.com\/coronavirus-travel-updates\/\",\"name\":\"CoronaVirus - Travel updates - Airlines-Airports\",\"isPartOf\":{\"@id\":\"https:\/\/airlines-airports.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/airlines-airports.com\/coronavirus-travel-updates\/#primaryimage\"},\"datePublished\":\"2020-02-02T07:24:59+00:00\",\"dateModified\":\"2021-06-01T04:25:00+00:00\",\"author\":{\"@id\":\"https:\/\/airlines-airports.com\/#\/schema\/person\/64e591ba7d9ae3cb638db29f25e506bf\"},\"description\":\"Travel advisory regarding Coronavirus for travelling to and from China. Before booking your flight tickets, check the CoronaVirus-Travel updates here.\",\"breadcrumb\":{\"@id\":\"https:\/\/airlines-airports.com\/coronavirus-travel-updates\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/airlines-airports.com\/coronavirus-travel-updates\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/airlines-airports.com\/coronavirus-travel-updates\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/airlines-airports.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"CoronaVirus &#8211; Travel updates\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/airlines-airports.com\/#\/schema\/person\/64e591ba7d9ae3cb638db29f25e506bf\",\"name\":\"Editor\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/airlines-airports.com\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/df028829c1cd10ce1ddebb58ad4a0814?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/df028829c1cd10ce1ddebb58ad4a0814?s=96&d=mm&r=g\",\"caption\":\"Editor\"}}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"CoronaVirus - Travel updates - Airlines-Airports","description":"Travel advisory regarding Coronavirus for travelling to and from China. Before booking your flight tickets, check the CoronaVirus-Travel updates here.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/airlines-airports.com\/coronavirus-travel-updates\/","og_locale":"en_US","og_type":"article","og_title":"CoronaVirus - Travel updates - Airlines-Airports","og_description":"Travel advisory regarding Coronavirus for travelling to and from China. Before booking your flight tickets, check the CoronaVirus-Travel updates here.","og_url":"https:\/\/airlines-airports.com\/coronavirus-travel-updates\/","og_site_name":"Airlines-Airports","article_published_time":"2020-02-02T07:24:59+00:00","article_modified_time":"2021-06-01T04:25:00+00:00","og_image":[{"width":600,"height":300,"url":"https:\/\/airlines-airports.com\/wp-content\/uploads\/2020\/02\/2019-novel-coronavirus-ncov.jpg","path":"\/var\/www\/html\/airlines-airports\/wp-content\/uploads\/2020\/02\/2019-novel-coronavirus-ncov.jpg","size":"full","id":77296,"alt":"","pixels":180000,"type":"image\/jpeg"}],"twitter_card":"summary","twitter_misc":{"Written by":"Editor","Est. reading time":"19 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/airlines-airports.com\/#website","url":"https:\/\/airlines-airports.com\/","name":"Airlines-Airports","description":"One stop destination for Airlines and Airports","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/airlines-airports.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/airlines-airports.com\/coronavirus-travel-updates\/#primaryimage","inLanguage":"en-US","url":"https:\/\/airlines-airports.com\/wp-content\/uploads\/2020\/02\/2019-novel-coronavirus-ncov.jpg","contentUrl":"https:\/\/airlines-airports.com\/wp-content\/uploads\/2020\/02\/2019-novel-coronavirus-ncov.jpg","width":600,"height":300},{"@type":"WebPage","@id":"https:\/\/airlines-airports.com\/coronavirus-travel-updates\/#webpage","url":"https:\/\/airlines-airports.com\/coronavirus-travel-updates\/","name":"CoronaVirus - Travel updates - Airlines-Airports","isPartOf":{"@id":"https:\/\/airlines-airports.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/airlines-airports.com\/coronavirus-travel-updates\/#primaryimage"},"datePublished":"2020-02-02T07:24:59+00:00","dateModified":"2021-06-01T04:25:00+00:00","author":{"@id":"https:\/\/airlines-airports.com\/#\/schema\/person\/64e591ba7d9ae3cb638db29f25e506bf"},"description":"Travel advisory regarding Coronavirus for travelling to and from China. Before booking your flight tickets, check the CoronaVirus-Travel updates here.","breadcrumb":{"@id":"https:\/\/airlines-airports.com\/coronavirus-travel-updates\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/airlines-airports.com\/coronavirus-travel-updates\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/airlines-airports.com\/coronavirus-travel-updates\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/airlines-airports.com\/"},{"@type":"ListItem","position":2,"name":"CoronaVirus &#8211; Travel updates"}]},{"@type":"Person","@id":"https:\/\/airlines-airports.com\/#\/schema\/person\/64e591ba7d9ae3cb638db29f25e506bf","name":"Editor","image":{"@type":"ImageObject","@id":"https:\/\/airlines-airports.com\/#personlogo","inLanguage":"en-US","url":"https:\/\/secure.gravatar.com\/avatar\/df028829c1cd10ce1ddebb58ad4a0814?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/df028829c1cd10ce1ddebb58ad4a0814?s=96&d=mm&r=g","caption":"Editor"}}]}},"_links":{"self":[{"href":"https:\/\/airlines-airports.com\/wp-json\/wp\/v2\/posts\/77295"}],"collection":[{"href":"https:\/\/airlines-airports.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/airlines-airports.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/airlines-airports.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/airlines-airports.com\/wp-json\/wp\/v2\/comments?post=77295"}],"version-history":[{"count":2,"href":"https:\/\/airlines-airports.com\/wp-json\/wp\/v2\/posts\/77295\/revisions"}],"predecessor-version":[{"id":86731,"href":"https:\/\/airlines-airports.com\/wp-json\/wp\/v2\/posts\/77295\/revisions\/86731"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/airlines-airports.com\/wp-json\/wp\/v2\/media\/77296"}],"wp:attachment":[{"href":"https:\/\/airlines-airports.com\/wp-json\/wp\/v2\/media?parent=77295"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/airlines-airports.com\/wp-json\/wp\/v2\/categories?post=77295"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/airlines-airports.com\/wp-json\/wp\/v2\/tags?post=77295"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}